#include "pch.h"

int main()
{
    _tsetlocale(0, _T(""));
    _tprintf(_T("크로스플랫폼 라이브러리 제작 중\n"));

    // 1. 네트워크 (Socket, Serial, HTTP) 라이브러리
    // 2. 서버+DB+클라우드 솔루션
    // 3. GUI(Control, GDI+, D2D) 라이브러리
    // 4. 서버-키오스크-POS-모바일 솔루션
    // 5. 멀티랭귀지 솔루션 (Python, Java, C#)
    // 6. 인공지능/데이터분석 라이브러리 (+python)
    // 7. 머신비전(시각)/STT,TTS(귀,입)/장비연동(물리작용부(촉각), 화학작용부(미각,후각)) 라이브러리
    // 8. 실장비 자동화 솔루션
    // 9. 계산과학(전산과학) 라이브러리 - 계산물리,계산화학,계산생물학 등
    // 10. VR/AR/MR/XR 라이브러리
    // 11. 그래픽스(OpenGL, DirectX, Vulkan) 라이브러리
    // 12. 기타 연동 라이브러리 (장비, 유행툴)
}